import { Tooltip } from "react-tooltip";

import "./App.css";
import agenda from "./assets/agenda.svg";

const mock = {
  "2022-05-31": 3,
  "2022-06-01": 3,
  "2022-06-03": 2,
  "2022-06-06": 3,
  "2022-06-10": 1,
  "2022-06-16": 12,
  "2022-06-17": 2,
  "2022-06-20": 4,
  "2022-06-21": 2,
  "2022-06-22": 4,
  "2022-06-23": 7,
  "2022-06-24": 1,
  "2022-06-25": 2,
  "2022-06-27": 3,
  "2022-06-28": 1,
  "2022-06-29": 4,
  "2022-06-30": 3,
  "2022-07-04": 3,
  "2022-07-05": 6,
  "2022-07-06": 8,
  "2022-07-07": 5,
  "2022-07-11": 3,
  "2022-07-12": 14,
  "2022-07-13": 2,
  "2022-07-15": 2,
  "2022-07-18": 1,
  "2022-07-19": 2,
  "2022-07-20": 3,
  "2022-07-21": 1,
  "2022-07-22": 5,
  "2022-07-25": 7,
  "2022-07-26": 2,
  "2022-07-27": 1,
  "2022-07-29": 1,
  "2022-08-01": 3,
  "2022-08-02": 3,
  "2022-08-05": 1,
  "2022-08-08": 2,
  "2022-08-10": 1,
  "2022-08-11": 2,
  "2022-08-12": 4,
  "2022-08-15": 8,
  "2022-08-16": 12,
  "2022-08-17": 5,
  "2022-08-18": 1,
  "2022-08-22": 3,
  "2022-09-05": 4,
  "2022-09-06": 1,
  "2022-09-07": 5,
  "2022-09-08": 2,
  "2022-09-09": 6,
  "2022-09-12": 2,
  "2022-09-13": 2,
  "2022-09-14": 2,
  "2022-09-15": 12,
  "2022-09-16": 7,
  "2022-09-19": 11,
  "2022-09-20": 3,
  "2022-09-21": 1,
  "2022-09-22": 3,
  "2022-09-23": 9,
  "2022-09-26": 8,
  "2022-09-27": 3,
  "2022-09-28": 20,
  "2022-09-29": 3,
  "2022-09-30": 10,
  "2022-10-02": 5,
  "2022-10-03": 8,
  "2022-10-04": 8,
  "2022-10-05": 10,
  "2022-10-06": 12,
  "2022-10-07": 7,
  "2022-10-09": 4,
  "2022-10-10": 11,
  "2022-10-11": 4,
  "2022-10-12": 2,
  "2022-10-13": 5,
  "2022-10-14": 1,
  "2022-10-17": 1,
  "2022-10-18": 6,
  "2022-10-19": 2,
  "2022-10-20": 3,
  "2022-10-21": 15,
  "2022-10-24": 6,
  "2022-10-25": 7,
  "2022-10-26": 13,
  "2022-10-27": 6,
  "2022-10-28": 11,
  "2022-10-29": 2,
  "2022-11-02": 3,
  "2022-11-03": 1,
  "2022-11-07": 4,
  "2022-11-08": 11,
  "2022-11-09": 1,
  "2022-11-10": 9,
  "2022-11-11": 10,
  "2022-11-15": 4,
  "2022-11-16": 1,
  "2022-11-17": 2,
  "2022-11-18": 3,
  "2022-11-21": 8,
  "2022-11-22": 2,
  "2022-11-23": 3,
  "2022-11-24": 5,
  "2022-11-25": 8,
  "2022-11-29": 3,
  "2022-11-30": 6,
  "2022-12-01": 5,
  "2022-12-02": 3,
  "2022-12-05": 4,
  "2022-12-06": 1,
  "2022-12-07": 5,
  "2022-12-08": 5,
  "2022-12-09": 2,
  "2022-12-12": 1,
  "2022-12-13": 10,
  "2022-12-15": 3,
  "2022-12-19": 1,
  "2022-12-20": 2,
  "2022-12-27": 1,
  "2022-12-28": 1,
  "2022-12-29": 6,
  "2022-12-30": 9,
  "2023-01-09": 7,
  "2023-01-10": 2,
  "2023-01-11": 5,
  "2023-01-12": 14,
  "2023-01-13": 3,
  "2023-01-16": 7,
  "2023-01-17": 9,
  "2023-01-18": 2,
  "2023-01-20": 6,
  "2023-01-23": 6,
  "2023-01-24": 2,
  "2023-01-26": 6,
  "2023-01-27": 1,
  "2023-01-30": 4,
  "2023-01-31": 1,
  "2023-02-02": 5,
  "2023-02-03": 4,
  "2023-02-06": 6,
  "2023-02-07": 5,
  "2023-02-08": 4,
  "2023-02-09": 4,
  "2023-02-10": 2,
  "2023-02-13": 5,
  "2023-02-14": 1,
  "2023-02-15": 2,
  "2023-02-17": 6,
  "2023-02-20": 7,
  "2023-02-21": 6,
  "2023-02-22": 8,
  "2023-02-27": 3,
  "2023-02-28": 1,
  "2023-03-01": 2,
  "2023-03-03": 39,
  "2023-03-06": 14,
  "2023-03-07": 6,
  "2023-03-09": 7,
  "2023-03-10": 7,
  "2023-03-13": 19,
  "2023-03-14": 21,
  "2023-03-15": 8,
  "2023-03-17": 1,
  "2023-03-20": 8,
  "2023-03-21": 8,
  "2023-03-22": 7,
  "2023-03-23": 7,
  "2023-03-24": 4,
  "2023-03-27": 1,
  "2023-03-28": 7,
  "2023-03-29": 4,
  "2023-03-30": 12,
  "2023-03-31": 5,
  "2023-04-03": 1,
  "2023-04-04": 2,
  "2023-04-05": 1,
  "2023-04-06": 7,
  "2023-04-07": 1,
  "2023-04-10": 5,
  "2023-04-11": 2,
  "2023-04-12": 1,
  "2023-04-13": 1,
  "2023-04-14": 2,
  "2023-04-17": 1,
  "2023-04-18": 2,
  "2023-04-19": 4,
  "2023-04-20": 1,
  "2023-04-21": 1,
  "2023-04-24": 3,
  "2023-04-25": 1,
  "2023-04-26": 1,
  "2023-05-02": 1,
  "2023-05-04": 4,
  "2023-05-05": 1,
  "2023-05-11": 1,
  "2023-05-12": 2,
  "2023-05-16": 1,
  "2023-05-18": 2,
};

function App() {
  const getDay = (date) => {
    const day = new Date(date).getDay();
    const month = new Date(date).getMonth();
    const getDate = new Date(date).getDate();
    const year = new Date(date).getFullYear();
    let result = "";

    switch (day) {
      case 0:
        result = "Воскресенье";
        break;
      case 1:
        result = "Понедельник";
        break;
      case 2:
        result = "Вторник";
        break;
      case 3:
        result = "Среда";
        break;
      case 4:
        result = "Четверг";
        break;
      case 5:
        result = "Пятница";
        break;
      case 6:
        result = "Суббота";
        break;
      default:
        return "";
    }

    switch (month) {
      case 0:
        result += ", Январь";
        break;
      case 1:
        result += ", Февраль";
        break;
      case 2:
        result += ", Март";
        break;
      case 3:
        result += ", Апрель";
        break;
      case 4:
        result += ", Май";
        break;
      case 5:
        result += ", Июнь";
        break;
      case 6:
        result += ", Июль";
        break;
      case 7:
        result += ", Август";
        break;
      case 8:
        result += ", Сентябрь";
        break;
      case 9:
        result += ", Октябрь";
        break;
      case 10:
        result += ", Ноябрь";
        break;
      case 11:
        result += ", Декабрь";
        break;
      default:
        return "";
    }

    result += ` ${getDate}, ${year}`;

    return result;
  };

  const renderGraph = () => {
    const startDate = new Date(2022, 2, 27, 0, 0, 0);
    let graphData = [];

    for (let i = 0; i < 357; i++) {
      const nextDay = new Date(startDate.setDate(startDate.getDate() + 1))
        .toISOString()
        .substring(0, 10);

      const count = Object.keys(mock).includes(nextDay) ? mock[nextDay] : 0;
      let color = "";

      if (1 <= count && count <= 9) {
        color = "#ACD5F2";
      } else if (10 <= count && count <= 19) {
        color = "#7FA8C9";
      } else if (20 <= count && count <= 29) {
        color = "#527BA0";
      } else if (30 <= count) {
        color = "#254E77";
      } else {
        color = "#EDEDED";
      }

      graphData.push({ date: nextDay, count, color });
    }

    return (
      <div
        style={{
          display: "flex",
          flexDirection: "column",
          flexWrap: "wrap",
          gap: "2px",
          width: "898px",
          height: "117px",
        }}
      >
        {graphData.map((elem, i) => (
          <>
            <div
              data-tooltip-id={i}
              className="elem"
              style={{ background: elem.color }}
              key={i}
            ></div>
            <Tooltip id={i} events={["click"]}>
              <div>{elem.count} contributions</div>
              <div style={{ color: "#7C7C7C" }}>{getDay(elem.date)}</div>
            </Tooltip>
          </>
        ))}
      </div>
    );
  };

  return (
    <div
      style={{
        display: "flex",
        flexDirection: "column",
        alignItems: "center",
        justifyContent: "center",
        height: "100vh",
      }}
    >
      <div>
        <div style={{ display: "flex", flexDirection: "column" }}>
          <div
            style={{
              display: "flex",
              flexDirection: "row",
              gap: "2.5rem",
              padding: "0 0 0.3rem 3rem",
            }}
          >
            <div>Апр.</div>
            <div>Май</div>
            <div>Июнь</div>
            <div>Июль</div>
            <div>Авг.</div>
            <div>Сент.</div>
            <div>Окт.</div>
            <div>Нояб.</div>
            <div>Дек.</div>
            <div>Янв.</div>
            <div>Фев.</div>
            <div>Март</div>
          </div>
          <div style={{ display: "flex", flexDirection: "row", gap: "0.5rem" }}>
            <div
              style={{
                display: "flex",
                flexDirection: "column",
                gap: "0.9rem",
                padding: "1rem 0 0 0",
              }}
            >
              <div>Пн</div>
              <div>Ср</div>
              <div>Пт</div>
            </div>
            <div>{renderGraph()}</div>
          </div>
        </div>
        <img src={agenda} style={{ margin: "1.9rem" }} />
      </div>
    </div>
  );
}

export default App;
